In [1]:
import pandas as pd
a = {
    "Emp_id" :[1,2,3,4,5,6,7,8,9],
    "Emp_name" :["Sam","Rohan","Soham","Priya","Sam","Aditya","Priya","Mohit","KK"] ,
    "Dept_Name" : ["IT","Operations","Sales","IT","Sales","HR","HR","IT","IT"],
    "Working_Hours" : [8,7,6,7,8,9,12,10,6] ,
    "Salary" : [34000 , 56000 , 45000,23000,10000,30000,24000,33000 , 67000]
}

df = pd.DataFrame(a)
df

   Emp_id Emp_name   Dept_Name  Working_Hours  Salary
0       1      Sam          IT              8   34000
1       2    Rohan  Operations              7   56000
2       3    Soham       Sales              6   45000
3       4    Priya          IT              7   23000
4       5      Sam       Sales              8   10000
5       6   Aditya          HR              9   30000
6       7    Priya          HR             12   24000
7       8    Mohit          IT             10   33000
8       9       KK          IT              6   67000

In [2]:
df.groupby('Dept_Name')['Salary'].sum()

Dept_Name
HR             54000
IT            157000
Operations     56000
Sales          55000
Name: Salary, dtype: int64

In [3]:
df['Dept_Name'].value_counts()

IT            4
Sales         2
HR            2
Operations    1
Name: Dept_Name, dtype: int64

In [4]:
import numpy as np
import pandas as pd
it_df = df[df['Dept_Name'] == 'IT']
print(it_df)
average_salary = np.median(it_df['Salary'])
print("Average salary of the IT department:", average_salary)

   Emp_id Emp_name Dept_Name  Working_Hours  Salary
0       1      Sam        IT              8   34000
3       4    Priya        IT              7   23000
7       8    Mohit        IT             10   33000
8       9       KK        IT              6   67000
Average salary of the IT department: 33500.0

In [7]:
average_salary = np.sum(it_df['Salary'])
print("Average salary of the IT department:", average_salary)

Average salary of the IT department: 157000

In [8]:
average_salary = np.mean(it_df['Salary'])
print("Average salary of the IT department:", average_salary)

Average salary of the IT department: 39250.0